// See https://aka.ms/new-console-template for more information
/*
Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. Не использовать string[].
*/

Console.WriteLine("Введите число: ");

int number = Convert.ToInt32(Console.ReadLine());

